all/.local/bin/org-style-lint
#!/usr/bin/env bash
# Lint script (fast, loud, opinionated)

# [[file:../../../loom.org::*Lint script (fast, loud, opinionated)][Lint script (fast, loud, opinionated):1]]
#!/usr/bin/env bash
set -euo pipefail

# Behavior:
# - Warn on *lowercase* #+begin_src / #+end_src
# - Do NOT fail the build by default.
# - Set STRICT_LINT=1 if you want warnings to be fatal.

shopt -s nullglob globstar
STATUS=0

# Match lowercase only (exact), not mixed/uppercase.
LOWER_BEGIN_RE='^[[:space:]]*#\+begin_src\b'
LOWER_END_RE='^[[:space:]]*#\+end_src\b'

echo "== org-style-lint =="
while IFS= read -r -d '' f; do
  # Report lowercase begin/end
  if grep -nE "$LOWER_BEGIN_RE|$LOWER_END_RE" "$f" >/dev/null 2>&1; then
    echo "!! Lowercase #+begin_src/#+end_src found (prefer UPPERCASE) → $f"
    grep -nE "$LOWER_BEGIN_RE|$LOWER_END_RE" "$f" || true
    STATUS=1
  fi
done < <(printf '%s\0' **/*.org)

if [ "${STRICT_LINT:-0}" = "1" ] && [ $STATUS -ne 0 ]; then
  exit 1
fi
exit 0
# Lint script (fast, loud, opinionated):1 ends here
